app/Controllers/Home.php

SELECT *
FROM `calendar`
WHERE `user_id` = '2'
AND `calendar`.`deleted_at` IS NULL
---
    public function dashboard(){

        //check subscription

        $user = $this->user();

        $this->session->set([
            'user' => $user
        ]);

        $this->template('dashboard/index',[
            'user' => $this->user(),
            'calendar' => $this->is_admin ? $this->calendar_model->findAll() : $this->calendar_model->where('user_id',$this->user_id)->findAll()